tutorials/incompressible/pimpleHFDIBFoam/impellerAndSphere/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
bodyNames ( "impellerSphere" "icoSphere" );

surfaceThreshold    1e-4;
stepDEM     0.02;
geometricD (1 1 -1);
recordSimulation true;
recordFirstTimeStep false;
nSolidsInDomain 1000;       //Sets Upper Limit On Number Of Particles In Domain if not spcecified sets to 1000 by default

outputSetup
{
    basic true;
    iB  false;
    DEM false;
    addModel true;
    parallelDEM false;
}

virtualMesh
{
    level 2;
    charCellSize 0.0012;
}

outputSetup
{
    basic true;
    iB  false;
    DEM false;
    addModel true;
    parallelDEM false;
}

DEM
{
    LcCoeff 4.0;
    materials
    {
        particle
        {
            Y       1e7;
            nu      0.3;
            mu      0.05;
            adhN    0;
            eps     0.5;
        }

        wall
        {
            Y       1e7;
            nu      0.2;
            mu      0;
            adhN    0;
            eps     0.5;
        }
    }

    collisionPatches
    {
		wall0
		{
			material wall;
			nVec (-1.0 0.0 0.0);
			planePoint (0.0 0.00 0.0);
		}
		wall1
		{
			material wall;
			nVec (1.0 0.0 0.0);
			planePoint (0.07 0.0 0.0);
		}
		wall2
		{
			material wall;
			nVec (0.0 1.0 0.0);
			planePoint (0.00 0.07 0.0);
		}

		wall3
		{
			material wall;
			nVec (0.0 -1.0 0.0);
			planePoint (0.0 0.0 0.0);
		}
    }
}
impellerSphere
{
prescribedTransRotBody
 {
    axis     (0 0 -1);
    velocity (0 0 0);
    omega    20;
 }
rho         rho [1 -3 0 0 0 0 0] 3950;
U
{
	BC  noSlip;
}
material particle;
bodyGeom nonConvex;
updateTorque false;
sdBasedLambda false;
interfaceSpan 1.0;
startSynced false;
refineBuffers 2;
timesToSetStatic -1;
bodyAddition
{
	addModel once;
	distributionCoeffs
	{
		addMode fieldBased;
        stlBaseSize        1e-5;
		fieldBasedCoeffs
		{
			fieldName lambda;
			fieldValue 0.05;
		}
		addDomain boundBox;
		boundBoxCoeffs
		{
			minBound (0 -0.00004 0);
			maxBound (0.0001628 -0.00001 0.0001628);
		}
	}
}
}

icoSphere
{
fullyCoupledBody;
rho         rho [1 -3 0 0 0 0 0] 3950;
U
{
	BC  noSlip;
}
material particle;
bodyGeom convex;
updateTorque false;
sdBasedLambda false;
interfaceSpan 1.0;
startSynced false;
refineBuffers 1;
timesToSetStatic -1;

bodyAddition
{
	addModel once;
	distributionCoeffs
	{
		addMode fieldBased;
        stlBaseSize        1e-5;
		fieldBasedCoeffs
		{
			fieldName lambda;
			fieldValue 0.05;
		}
		addDomain boundBox;
		boundBoxCoeffs
		{
			minBound (0 -0.00004 0);
			maxBound (0.0001628 -0.00001 0.0001628);
		}
	}
}
}
// ************************************************************************* //
